docs/perf-test/S5-15-exam-submit-stress-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <!--
      S5-15 交卷接口高并发压测计划
      目标：1000 学生在 30 秒内集中交卷，验证打散机制效果
      接口：POST /api/v1/exam/publishes/{publishId}/submit
      通过标准：
        - 所有请求成功率 ≥ 99.9%（允许 ≤1 次失败）
        - P99 响应时间 ≤ 5000ms（含 Kafka 异步落库延迟已剥离）
        - MySQL/Kafka 无超时或连接池耗尽错误
        - 幂等校验：同一学生重复提交仅入队一次（Redis SETNX 命中）
      含图片附件场景：主观题 answerContent 包含 MinIO 路径 JSON（≈800B payload）
    -->
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="交卷高并发压测 S5-15" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.arguments" elementType="Arguments">
        <collectionProp name="Arguments.arguments">
          <elementProp name="TARGET_HOST" elementType="Argument">
            <stringProp name="Argument.name">TARGET_HOST</stringProp>
            <stringProp name="Argument.value">100.84.68.115</stringProp>
          </elementProp>
          <elementProp name="TARGET_PORT" elementType="Argument">
            <stringProp name="Argument.name">TARGET_PORT</stringProp>
            <stringProp name="Argument.value">18080</stringProp>
          </elementProp>
          <elementProp name="PUBLISH_ID" elementType="Argument">
            <stringProp name="Argument.name">PUBLISH_ID</stringProp>
            <stringProp name="Argument.value">1</stringProp>
          </elementProp>
          <elementProp name="THREAD_COUNT" elementType="Argument">
            <stringProp name="Argument.name">THREAD_COUNT</stringProp>
            <stringProp name="Argument.value">1000</stringProp>
          </elementProp>
          <!-- 打散窗口：0~30s，模拟前端 getSubmitDelay() 行为 -->
          <elementProp name="SCATTER_MAX_MS" elementType="Argument">
            <stringProp name="Argument.name">SCATTER_MAX_MS</stringProp>
            <stringProp name="Argument.value">30000</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>

      <!-- ============================================================
           阶段0：预热 - 教师登录，发布考试并进入监考状态
           ============================================================ -->
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup"
                        testname="预热 - 教师发布考试" enabled="true">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <intProp name="ThreadGroup.ramp_time">0</intProp>
        <stringProp name="ThreadGroup.on_sample_error">stopTest</stringProp>
      </SetupThreadGroup>
      <hashTree>

        <!-- 教师登录 -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="教师登录" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"username":"teacher01","password":"edu2026@test"}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${TARGET_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${TARGET_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/auth/login</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Content-Type JSON" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="Content-Type" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <JSONPathExtractor guiclass="JSONPathExtractorGui" testname="提取教师Token" enabled="true">
            <stringProp name="JSONPathExtractor.referenceName">TEACHER_TOKEN</stringProp>
            <stringProp name="JSONPathExtractor.jsonPathExprs">$.data.accessToken</stringProp>
            <stringProp name="JSONPathExtractor.defaultValue">MISSING_TOKEN</stringProp>
          </JSONPathExtractor>
          <hashTree/>
        </hashTree>

        <!-- 更新 exam_publish.status = 1（进行中），确保压测期间考试有效 -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="开始考试（更新状态为进行中）" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${TARGET_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${TARGET_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/exam/publishes/${PUBLISH_ID}/start</stringProp>
          <stringProp name="HTTPSampler.method">PUT</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Teacher Auth" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="Authorization" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer ${TEACHER_TOKEN}</stringProp>
              </elementProp>
              <elementProp name="Content-Type" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>

      </hashTree>

      <!-- ============================================================
           阶段1 (CSV)：1000 学生先进入考试，获取各自的 session token
           CSV 文件格式：studentId,username,password
           参见 docs/perf-test/students-1000.csv（由 seed_dev.sql 生成）
           ============================================================ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="阶段1 - 1000学生进入考试" enabled="true">
        <intProp name="ThreadGroup.num_threads">${THREAD_COUNT}</intProp>
        <!-- 5秒内全部启动（进入考试比交卷早，无需打散） -->
        <intProp name="ThreadGroup.ramp_time">5</intProp>
        <intProp name="ThreadGroup.loops">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      </ThreadGroup>
      <hashTree>

        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="读取学生账号CSV" enabled="true">
          <stringProp name="filename">${__P(CSV_PATH,docs/perf-test/students-1000.csv)}</stringProp>
          <stringProp name="variableNames">STUDENT_ID,STUDENT_USERNAME,STUDENT_PASSWORD</stringProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <stringProp name="shareMode">shareMode.thread</stringProp>
          <boolProp name="recycle">false</boolProp>
          <boolProp name="stopThread">true</boolProp>
        </CSVDataSet>
        <hashTree/>

        <!-- 学生登录 -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="学生登录" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"username":"${STUDENT_USERNAME}","password":"${STUDENT_PASSWORD}"}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${TARGET_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${TARGET_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/auth/login</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Content-Type" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="Content-Type" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <JSONPathExtractor guiclass="JSONPathExtractorGui" testname="提取学生Token" enabled="true">
            <stringProp name="JSONPathExtractor.referenceName">STUDENT_TOKEN</stringProp>
            <stringProp name="JSONPathExtractor.jsonPathExprs">$.data.accessToken</stringProp>
            <stringProp name="JSONPathExtractor.defaultValue">MISSING</stringProp>
          </JSONPathExtractor>
          <hashTree/>
        </hashTree>

        <!-- 进入考试 -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="进入考试 enter" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${TARGET_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${TARGET_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/exam/publishes/${PUBLISH_ID}/enter</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Student Auth" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="Authorization" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer ${STUDENT_TOKEN}</stringProp>
              </elementProp>
              <elementProp name="Content-Type" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <!-- 将 token 存入 props 供下一阶段使用（key = studentId） -->
          <BeanShellPostProcessor guiclass="TestBeanGUI" testclass="BeanShellPostProcessor"
                                  testname="保存学生Token到文件" enabled="true">
            <stringProp name="script">
              String token = vars.get("STUDENT_TOKEN");
              String sid   = vars.get("STUDENT_ID");
              props.put("student_token_" + sid, token);
            </stringProp>
          </BeanShellPostProcessor>
          <hashTree/>
        </hashTree>

      </hashTree>

      <!-- ============================================================
           阶段2（核心）：1000 学生在 30 秒内集中交卷（含图片附件）
           Random Timer 模拟打散机制（0~30s 随机延迟）
           幂等测试：前 50 个线程额外多发一次相同请求
           ============================================================ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="阶段2 - 核心：1000学生集中交卷（30s打散）" enabled="true">
        <intProp name="ThreadGroup.num_threads">${THREAD_COUNT}</intProp>
        <!-- ramp_time=0：全部同时出发，由 Random Timer 实现打散，与生产场景一致 -->
        <intProp name="ThreadGroup.ramp_time">0</intProp>
        <intProp name="ThreadGroup.loops">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <!-- 硬超时：50秒后剩余线程强制中止 -->
        <longProp name="ThreadGroup.duration">50</longProp>
        <longProp name="ThreadGroup.delay">10</longProp>
      </ThreadGroup>
      <hashTree>

        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="读取学生账号CSV（阶段2）" enabled="true">
          <stringProp name="filename">${__P(CSV_PATH,docs/perf-test/students-1000.csv)}</stringProp>
          <stringProp name="variableNames">STUDENT_ID,STUDENT_USERNAME,STUDENT_PASSWORD</stringProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <stringProp name="shareMode">shareMode.thread</stringProp>
          <boolProp name="recycle">false</boolProp>
          <boolProp name="stopThread">true</boolProp>
        </CSVDataSet>
        <hashTree/>

        <!-- 从 Phase1 存的 props 恢复 token -->
        <BeanShellPreProcessor guiclass="TestBeanGUI" testclass="BeanShellPreProcessor"
                               testname="恢复学生Token" enabled="true">
          <stringProp name="script">
            String sid   = vars.get("STUDENT_ID");
            String token = props.getProperty("student_token_" + sid, "MISSING");
            vars.put("STUDENT_TOKEN", token);
          </stringProp>
        </BeanShellPreProcessor>
        <hashTree/>

        <!-- 打散定时器：模拟学号末两位取模 0~30s 延迟 -->
        <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer"
                            testname="交卷打散定时器（0~30s）" enabled="true">
          <stringProp name="ConstantTimer.delay">0</stringProp>
          <stringProp name="RandomTimer.range">${SCATTER_MAX_MS}</stringProp>
        </UniformRandomTimer>
        <hashTree/>

        <!-- 交卷请求（含主观题图片附件 JSON，模拟 ≈800B payload） -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="POST 交卷（含图片附件）" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{
  "answers": [
    {"questionId": 1, "answerContent": "A"},
    {"questionId": 2, "answerContent": "BC"},
    {"questionId": 3, "answerContent": "T"},
    {"questionId": 4, "answerContent": "B"},
    {"questionId": 5, "answerContent": "ACD"},
    {
      "questionId": 6,
      "answerContent": "{\"text\":\"本题答案如附件所示，主要论述了数据库范式理论在实际系统设计中的应用场景及其局限性。\",\"attachments\":[\"edu-files/exam-answers/${PUBLISH_ID}/${STUDENT_ID}/q6-attachment.jpg\"]}"
    }
  ],
  "submitType": "AUTO",
  "clientSubmitAt": "${__time(yyyy-MM-dd'T'HH:mm:ss.SSS'Z',)}"
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${TARGET_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${TARGET_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/exam/publishes/${PUBLISH_ID}/submit</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <stringProp name="HTTPSampler.response_timeout">10000</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Student Auth（阶段2）" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="Authorization" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer ${STUDENT_TOKEN}</stringProp>
              </elementProp>
              <elementProp name="Content-Type" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>

          <!-- 断言：HTTP 200 -->
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                             testname="响应码断言 200" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="51">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>

          <!-- 断言：业务 code = 200 -->
          <JSONPathAssertion guiclass="JSONPathAssertionGui" testclass="JSONPathAssertion"
                             testname="业务 code=200 断言" enabled="true">
            <stringProp name="JSON_PATH">$.code</stringProp>
            <stringProp name="EXPECTED_VALUE">200</stringProp>
            <boolProp name="JSONVALIDATION">true</boolProp>
            <boolProp name="EXPECT_NULL">false</boolProp>
            <boolProp name="INVERT">false</boolProp>
          </JSONPathAssertion>
          <hashTree/>
        </hashTree>

      </hashTree>

      <!-- ============================================================
           阶段3：幂等性测试 - 50名学生重复交卷（期望 code=200 幂等返回）
           ============================================================ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="阶段3 - 幂等性：50学生重复交卷" enabled="true">
        <intProp name="ThreadGroup.num_threads">50</intProp>
        <intProp name="ThreadGroup.ramp_time">2</intProp>
        <intProp name="ThreadGroup.loops">2</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <!-- 延后 35 秒启动，确保 Phase2 已完成 -->
        <longProp name="ThreadGroup.delay">35</longProp>
      </ThreadGroup>
      <hashTree>

        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="读取前50学生（幂等测试）" enabled="true">
          <stringProp name="filename">${__P(CSV_PATH,docs/perf-test/students-1000.csv)}</stringProp>
          <stringProp name="variableNames">STUDENT_ID,STUDENT_USERNAME,STUDENT_PASSWORD</stringProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <stringProp name="shareMode">shareMode.thread</stringProp>
          <boolProp name="recycle">true</boolProp>
          <boolProp name="stopThread">false</boolProp>
        </CSVDataSet>
        <hashTree/>

        <BeanShellPreProcessor guiclass="TestBeanGUI" testclass="BeanShellPreProcessor"
                               testname="恢复学生Token（幂等）" enabled="true">
          <stringProp name="script">
            String sid   = vars.get("STUDENT_ID");
            String token = props.getProperty("student_token_" + sid, "MISSING");
            vars.put("STUDENT_TOKEN", token);
          </stringProp>
        </BeanShellPreProcessor>
        <hashTree/>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="重复交卷（幂等校验）" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{
  "answers": [
    {"questionId": 1, "answerContent": "A"},
    {"questionId": 2, "answerContent": "BC"},
    {"questionId": 3, "answerContent": "T"}
  ],
  "submitType": "MANUAL",
  "clientSubmitAt": "${__time(yyyy-MM-dd'T'HH:mm:ss.SSS'Z',)}"
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${TARGET_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${TARGET_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/exam/publishes/${PUBLISH_ID}/submit</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Student Auth（幂等）" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="Authorization" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer ${STUDENT_TOKEN}</stringProp>
              </elementProp>
              <elementProp name="Content-Type" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>

          <!-- 幂等：重复交卷仍返回 code=200（不是 4xx） -->
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                             testname="幂等响应码断言 200" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="51">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

      </hashTree>

      <!-- ============================================================
           监听器
           ============================================================ -->

      <!-- 聚合报告（看 TPS/P99/Error Rate） -->
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector"
                       testname="聚合报告" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">docs/perf-test-reports/S5-15-submit-result.jtl</stringProp>
      </ResultCollector>
      <hashTree/>

      <!-- 响应时间折线图（查看打散效果：请求到达时间是否均匀分布） -->
      <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector"
                       testname="响应时间趋势图" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>

      <!-- 仅记录错误详情 -->
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector"
                       testname="错误详情（仅失败请求）" enabled="true">
        <boolProp name="ResultCollector.error_logging">true</boolProp>
        <stringProp name="filename">docs/perf-test-reports/S5-15-errors.jtl</stringProp>
      </ResultCollector>
      <hashTree/>

      <!-- BackendListener → Prometheus PushGateway（可选，监控 Grafana） -->
      <BackendListener guiclass="BackendListenerGui" testclass="BackendListener"
                       testname="Prometheus PushGateway（可选）" enabled="false">
        <elementProp name="arguments" elementType="Arguments">
          <collectionProp name="Arguments.arguments">
            <elementProp name="influxdbMetricsSender" elementType="Argument">
              <stringProp name="Argument.name">influxdbMetricsSender</stringProp>
              <stringProp name="Argument.value">org.apache.jmeter.visualizers.backend.influxdb.HttpMetricsSender</stringProp>
            </elementProp>
            <elementProp name="influxdbUrl" elementType="Argument">
              <stringProp name="Argument.name">influxdbUrl</stringProp>
              <stringProp name="Argument.value">http://100.84.68.115:8086/write?db=jmeter</stringProp>
            </elementProp>
          </collectionProp>
        </elementProp>
        <stringProp name="classname">org.apache.jmeter.visualizers.backend.influxdb.InfluxdbBackendListenerClient</stringProp>
      </BackendListener>
      <hashTree/>

    </hashTree>
  </hashTree>
</jmeterTestPlan>